namespace RBSoftSkkm
{
    /// <summary>
    /// Система налогообложения:
    /// <para>
    /// ОСН - Общий
    /// </para>
    /// <para>
    /// УСН - Упрощенная Доход
    /// </para>
    /// <para>
    /// УСНД_Р - Упрощенная Доход минус Расход
    /// </para>
    /// <para>
    /// ЕНВД - Единый налог на вмененный доход
    /// </para>
    /// <para>
    /// ЕСН - Единый сельскохозяйственный налог
    /// </para>
    /// <para>
    /// ПСН - Патентная система налогообложения
    /// </para>
    /// </summary>
    public enum TaxSystem
    {
        /// <summary>
        /// Общий
        /// </summary>
        Osn = 0,

        /// <summary>
        /// Упрощенная Доход
        /// </summary>
        Usn = 1,

        /// <summary>
        /// Упрощенная Доход минус Расход
        /// </summary>
        UsnDr = 2,

        /// <summary>
        /// Единый налог на вмененный доход
        /// </summary>
        Envd = 3,

        /// <summary>
        /// Единый сельскохозяйственный налог
        /// </summary>
        Esn = 4,

        /// <summary>
        /// Патентная система налогообложения
        /// </summary>
        Psn = 5,
    }
}
